project-root/app/Libraries/GegenstandHelper.php

    public static function getAll()
    {
        $gegenstandModel = new GegenstandModel();
        $gegenstand = $gegenstandModel->FindAll();
---
SELECT *
FROM `gegenstand`

    public static function getById($id)
    {
        $gegenstandModel = new GegenstandModel();
        $gegenstand = $gegenstandModel->where("gegenstand_id", $id)->First();
---
SELECT *
FROM `gegenstand`
WHERE `gegenstand_id` = 'Ges'
 LIMIT 1

    public static function add($id, $bezeichnung)
    {
        $data = [
            'gegenstand_id' => $id,
            'bezeichnung' => $bezeichnung
        ];

        $gegenstandModel = new GegenstandModel();

        // Inserts data and returns inserted row's primary key
        $gegenstandDbId = $gegenstandModel->insert($data);
---
INSERT INTO `gegenstand` (`gegenstand_id`, `bezeichnung`) VALUES ('Ges', '/')