project-root/app/Libraries/LeihtHelper.php

SELECT *
FROM `leiht`
WHERE `aktiv` = 1
ORDER BY `datum_start` DESC
---
    public static function getActiveDesc()
    {
        $leihtModel = new LeihtModel();

        $leiht = $leihtModel->where("aktiv", 1)->orderBy("datum_start", "DESC")->FindAll();

SELECT *
FROM `leiht`
WHERE `aktiv` = '1'
---
    public static function getUeberfaellig()
    {
        $leihtModel = new LeihtModel();

        $leiht = $leihtModel->where("aktiv", "1")->FindAll();

SELECT *
FROM `leiht`
WHERE `gegenstand_id` = 'Ges'
AND `aktiv` = 1
 LIMIT 1
---
    public static function getActiveByGegenstandId($gegenstand_id)
    {
        $leihtModel = new LeihtModel();
        $leiht = $leihtModel->where("gegenstand_id", $gegenstand_id)->where("aktiv", 1)->First();

SELECT *
FROM `leiht`
WHERE `gegenstand_id` = 'Ges'
---
    public static function getByGegenstandId($gegenstand_id)
    {
        $leihtModel = new LeihtModel();
        $leiht = $leihtModel->where("gegenstand_id", $gegenstand_id)->Find();

SELECT *
FROM `leiht`
GROUP BY `lehrer`
---
    public static function getAllLehrer()
    {
        $leihtModel = new LeihtModel();

        $leiht = $leihtModel->GroupBy('lehrer')->FindAll();

INSERT INTO `leiht` (`schueler_id`, `gegenstand_id`, `datum_start`, `datum_ende`, `weitere`, `lehrer`, `aktiv`) VALUES ('AGa', 'GEs', '2024-02-28 12:32:35', NULL, 0, '/', 1)
---
    public static function add($schueler_id, $gegenstand_id, $datum_start = false, $datum_ende = false, $weitere = false, $lehrer = false, $aktiv = 1)
    {
        $datumStart = $datum_start;
        $datumEnde = $datum_ende;

        if($datum_start == false)
        {
            $datumStart = date("Y-m-d H:i:s");
        }
        if($datum_ende == false)
        {
            $datumEnde = null;
        }

        $data = [
            'schueler_id' => $schueler_id,
            'gegenstand_id' => $gegenstand_id,
            'datum_start' => $datumStart,
            'datum_ende' => $datumEnde,
            'weitere' => $weitere,
            'lehrer' => $lehrer,
            'aktiv'    => $aktiv,
        ];

        $leihtModel = new LeihtModel();

        // Inserts data and returns inserted row's primary key
        $leihtDbId = $leihtModel->insert($data);