project-root/app/Libraries/SchuelerHelper.php

SELECT *
FROM `schueler`
---
    public static function getAll()
    {
        $schuelerModel = new SchuelerModel();
        $schueler = $schuelerModel->FindAll();

SELECT *
FROM `schueler`
WHERE `schueler_id` = 'AGa'
 LIMIT 1
---
    public static function getById($id)
    {
        $schuelerModel = new SchuelerModel();
        $schueler = $schuelerModel->where("schueler_id", $id)->First();

SELECT *
FROM `schueler`
ORDER BY `name`
---
    public static function getAllOrderByName()
    {
        $schuelerModel = new SchuelerModel();
        $schueler = $schuelerModel->OrderBy('name')->FindAll();

INSERT INTO `schueler` (`schueler_id`, `name`, `mail`) VALUES ('AGa', 'Test', NULL)
---
    public static function add($id, $name, $mail = null)
    {
        $data = [
            'schueler_id' => $id,
            'name' => $name,
            'mail'    => $mail,
        ];

        $schuelerModel = new SchuelerModel();

        // Inserts data and returns inserted row's primary key
        $schuelerDbId = $schuelerModel->insert($data);